## [DataFrame 인덱스 다루기]

(1) 모듈로딩 <hr>

In [50]:
import pandas as pd
import random

(2) 데이터 준비 <hr>

In [51]:
# dict 타입의 데이터를 준비
def genRandomScore(i = 5, start = 60, end = 100):
    return [x for x in random.sample(range(start, end + 1),i)]
exam = {
    'name' : ['가나다',
              '마바사',
              '아자차',
              '차카파',
              '타파하',
              ],
    'math' : genRandomScore(),
    'korean' : genRandomScore(),
    'art' : genRandomScore(),
    'gym' : genRandomScore(),
}

(3) 데이터 저장 <hr>

In [52]:
examDF = pd.DataFrame(exam)

(4) 데이터 확인 <hr>

In [53]:
examDF

  name  math  korean  art  gym
0  가나다   100      84   95   94
1  마바사    73      87   96   64
2  아자차    70      93   69   71
3  차카파    93      65   94   75
4  타파하    84      92   82   89

(5) 새로운 인덱스 설정 : 컬럼 ===> 방법1 : 인덱스의 일부 변경.rename() <hr>

inplace 매개변수/파라미터 ==> 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!

In [54]:
# 행 인덱스 일부 변경 => 기존인덱스:새로운 인덱스
examDF.rename(index={
    0 : 'Zero'
})
# 바꿔지긴 하나 복사본이 바뀌는 것임, inplace를 지정해주어야 함

     name  math  korean  art  gym
Zero  가나다   100      84   95   94
1     마바사    73      87   96   64
2     아자차    70      93   69   71
3     차카파    93      65   94   75
4     타파하    84      92   82   89

In [55]:
examDF

  name  math  korean  art  gym
0  가나다   100      84   95   94
1  마바사    73      87   96   64
2  아자차    70      93   69   71
3  차카파    93      65   94   75
4  타파하    84      92   82   89

In [56]:
examDF.rename({
    0 : 'Zero'
}, inplace=True)
examDF
# 이렇게 원본 데이터가 바뀌는 것을 확인해볼 수 있음

     name  math  korean  art  gym
Zero  가나다   100      84   95   94
1     마바사    73      87   96   64
2     아자차    70      93   69   71
3     차카파    93      65   94   75
4     타파하    84      92   82   89

In [57]:
# 열 이름 인덱스 일부 변경 => column = {기존인덱스:새로운인덱스}

examDF.rename(columns={
    'gym' : 'music'
}, inplace=1)

examDF

     name  math  korean  art  music
Zero  가나다   100      84   95     94
1     마바사    73      87   96     64
2     아자차    70      93   69     71
3     차카파    93      65   94     75
4     타파하    84      92   82     89

(5) 새로운 인덱스 설정 - 방법2: 특정 컬럼 => 인덱스 :

In [58]:
# 현재 기본 0 ~ => 이름 컬럼 인덱스로 설정
examDF.index

Index(['Zero', 1, 2, 3, 4], dtype='object')

In [59]:
# 1개 컬럼을 인덱스로 설정, 단 inplace 파라메터가 False로 원본 적용 안됨
examDF.set_index('name', inplace=False)
# examDF

      math  korean  art  music
name
가나다    100      84   95     94
마바사     73      87   96     64
아자차     70      93   69     71
차카파     93      65   94     75
타파하     84      92   82     89

In [60]:
multiindex = examDF.set_index(['name', 'math', 'korean'])
multiindex

                  art  music
name math korean
가나다  100  84       95     94
마바사  73   87       96     64
아자차  70   93       69     71
차카파  93   65       94     75
타파하  84   92       82     89

In [61]:
multiindex.index

MultiIndex([('가나다', 100, 84),
            ('마바사',  73, 87),
            ('아자차',  70, 93),
            ('차카파',  93, 65),
            ('타파하',  84, 92)],
           names=['name', 'math', 'korean'])

In [62]:
multiindex.loc['가나다']
# 인덱스중 일부만 조회할 경우 데이터프레임으로 인덱스가 포함된 값만 나옴

             art  music
math korean
100  84       95     94

In [63]:
multiindex.loc[('가나다', multiindex.index[0][1])]

        art  music
korean
84       95     94

In [64]:
multiindex.loc[(multiindex.index[0][0], multiindex.index[0][1], multiindex.index[0][2])]

art      95
music    94
Name: (가나다, 100, 84), dtype: int64

(5) 새로운 인덱스 설정 - 방법3: 인덱스 제거하기

In [66]:
examDF.set_index('name', inplace=True)
examDF

      math  korean  art  music
name
가나다    100      84   95     94
마바사     73      87   96     64
아자차     70      93   69     71
차카파     93      65   94     75
타파하     84      92   82     89

In [70]:
# inplace은 기본적으로 False로 설정되어 있다.
examDF.reset_index()

  name  math  korean  art  music
0  가나다   100      84   95     94
1  마바사    73      87   96     64
2  아자차    70      93   69     71
3  차카파    93      65   94     75
4  타파하    84      92   82     89

In [71]:

examDF.reset_index().reset_index().reset_index()

   level_0  index name  math  korean  art  music
0        0      0  가나다   100      84   95     94
1        1      1  마바사    73      87   96     64
2        2      2  아자차    70      93   69     71
3        3      3  차카파    93      65   94     75
4        4      4  타파하    84      92   82     89

In [73]:
# 현재 행 인덱스를 컴럼에 추가 하지 않고 삭제 => drop 파라미터를 True로 설정 
examDF.reset_index().reset_index().reset_index().reset_index(drop=True).reset_index(drop=True).reset_index(drop=True)

   level_0  index name  math  korean  art  music
0        0      0  가나다   100      84   95     94
1        1      1  마바사    73      87   96     64
2        2      2  아자차    70      93   69     71
3        3      3  차카파    93      65   94     75
4        4      4  타파하    84      92   82     89